read_liberty -lib /mnt/volume_sky130/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib

read_verilog ../butterfly/butterfly.v
read_verilog ../butterfly/twiddle.v
read_verilog ../butterfly/signed_multiplier.v
read_verilog ../butterfly/FFT.v 

synth -top FFT
flatten
dfflibmap -liberty /mnt/volume_sky130/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib
abc -liberty /mnt/volume_sky130/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib
opt_clean

stat -liberty /mnt/volume_sky130/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib 
write_verilog FFT_gl.v
