read_liberty /mnt/volume_sky130/skywater-pdk/libraries/sky130_fd_sc_hd/latest/timing/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog butterfly2.v
link_design butterfly2

report_checks
report_power
exit


